#include <iostream>
using namespace std;

int main()
{
	// Не знаем колко точно числа ще въведе потребителят, 
	// но знаем че ще бъдат най-много 100, 
	// за това създаваме масив от 100 елемента.
	int numbers[100];

	// Въвеждане на брой числа от клавиатурата
	// и проверка на условието броят на числата да бъде най-малко 1 или най-много 100.
	int n;
	do
	{
		cout << "Enter positive count of numbers: ";
		cin >> n;
	} while (n < 1 || n > 100);

	// Въвеждане на n брой числа от клавиатурата
	for (int i = 0; i < n; i++)
	{
		cout << "Enter number " << i + 1 << ": ";
		cin >> numbers[i];
	}

	// Обхождаме всеки елемент от масива
	for (int i = 0; i < n - 1; i++)
	{
		// На всяка итерация обозначаваме елемента на текущия индекс като минимален
		int min = numbers[i];
		int minIndex = i;

		// Обхождаме елементите, които се намират след текущия
		for (int j = i + 1; j < n; j++)
		{
			// Проверяваме дали някой от следващите елементи
			// не е по-малък от текущия минимален елемент
			if (numbers[j] < min)
			{
				// Ако намерим по-малък елемент
				// променяме текущия най-малък елемент
				// и вземаме индекса му
				min = numbers[j];
				minIndex = j;
			}
		}
		
		// Разменяме текущия елемент с най-малкия елемент от последващите го.
		numbers[minIndex] = numbers[i];
		numbers[i] = min;
	}

	// Извеждаме сортирания масив
	for (int i = 0; i < n; i++)
	{
		cout << numbers[i] << " ";
	}

	return 0;
}