#include <iostream>
using namespace std;

int main()
{
	// Не знаем колко точно числа ще въведе потребителят, 
	// но знаем че ще бъдат най-много 100, 
	// за това създаваме масив от 100 елемента.
	int numbers[100];

	// Въвеждане на брой числа от клавиатурата
	// и проверка на условието броят на числата да бъде най-малко 1 или най-много 100.
	int n;
	do
	{
		cout << "Enter positive count of numbers: ";
		cin >> n;
	} while (n < 1 || n > 100);

	// Въвеждане на n брой числа от клавиатурата
	for (int i = 0; i < n; i++)
	{
		cout << "Enter number " << i + 1 << ": ";
		cin >> numbers[i];
	}

	// Сравняваме всеки два съседни елемента
	// докато текущия е по-малък от следващия
	// или сме достигнали до края на масива
	int i = 0;
	while (numbers[i] < numbers[i + 1] && i < n - 2 )
	{
		i++;
	}

	// Проверяваме дали последните два проверени елемента са монотонно растящи
	// тъй като причината за прекъсване на цикъла може да бъде това, 
	// че сме обходили всички елементи
	if (numbers[i] < numbers[i + 1])
	{
		cout << "Growing" << endl;
	}
	else
	{
		cout << "Not growing" << endl;
	}

	return 0;
}