
#include <iostream>
using namespace std;

int main()
{
	// Не знаем колко точно числа ще въведе потребителят, 
	// но знаем че ще бъдат най-много 100, 
	// за това създаваме масив от 100 елемента.
	int numbers[100];

	// Въвеждане на брой числа от клавиатурата
	// и проверка на условието броят на числата да бъде най-малко 1 и най-много 100.
	int n;
	do
	{
		cout << "Enter positive count of numbers: ";
		cin >> n;
	} while (n < 1 || n > 100);

	// Въвеждане на n брой числа от клавиатурата
	for (int i = 0; i < n; i++)
	{
		// Въвеждане на число в масива на индекс i
		cout << "Enter number " << i + 1 << ": ";
		cin >> numbers[i];
	}

	// Намиране на най-голямото число в редицата
	// Първоначално обозначаваме първото число като най-голямо
	int max = numbers[0];
	for (int i = 0; i < n; i++)
	{
		// При всяка итерация сравняваме текущото число с максималното 
		// и ако текущото е по-голямо променяме стойността на максималното число.
		if (numbers[i] > max)
		{
			max = numbers[i];
		}
	}
	// Извеждаме максималното число
	cout << "Max number is: " << max << endl;

	return 0;
}